Tekla Open API Reference for Tekla Structures 2025
Solid.GetAllIntersectionPoints Method
 Used to get all the intersection points between the solid and a plane. Does not arrange the points into polygons, thus a lot faster.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerator GetAllIntersectionPoints(
	Point point1,
	Point point2,
	Point point3
)
Public Function GetAllIntersectionPoints (
	point1 As Point,
	point2 As Point,
	point3 As Point
) As IEnumerator
Parameters
point1
Type: Tekla.Structures.Geometry3d.Point
1st of the 3 points defining a plane
point2
Type: Tekla.Structures.Geometry3d.Point
2nd of the 3 points defining a plane
point3
Type: Tekla.Structures.Geometry3d.Point
3rd of the 3 points defining a plane
Return Value
Type: IEnumerator
An IEnumerator containing the intersection points of type the Point
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace